# DoubleClickOptions Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DoubleClickOptions Properties
DoubleClickOptions Class See Also
---
The DoubleClickOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
DoubleClickOptions Class
Autodesk.Revit.UI Namespace